Alexandra Coffin
2023 Feb 6
Data Analytics Fundementals
Dr. Case
accoffin_2

# Example 7.14.2: Data Frames
(1) See the text Ch 7.14.2.
(2) For more complex data, we can use a DataFrame. In a DataFrame, each value is a Series of numbers.
(3) We can use a two-dimensional DataFrame to handle many  exam scores for each key/student.
(4) Create a new notebook to practice using DataFrames.
(5) Name the notebook yourname_2.ipynb.
(6) Use your Markdown skills to add a customized title to your notebook. 
(7) Use Markdown heading for each section below.

## Create DataFrame
Using 7.14.2 create a DataFrame from a dictionary holding multiple exam scores for each key\student.
Use 5 students, each with 3 exam scores, but scores aren't labeled.

I always check for a pandas install as there where issues with ensureing it was in the correct PATH.

In [21]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\tower\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\users\tower\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\tower\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\tower\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\tower\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [22]:
import pandas as pd

In [23]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie':[100, 81, 82], 'Bob': [83, 65, 85]}

In [24]:
grades = pd.DataFrame(grades_dict)

In [25]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## 1. Custom Index:
(1) Follow the instructions to apply a custom index (instead of 0,1,2), let's call them 'Test1', Test2', and 'Test3'. See 'Customizing a DataFrame's Indices with the index Attribute subsection. 

(2) As we did in Part 1, we can request grades by key using the text attribute (square brackets with single quoted text strings). Find Eva's grades with grades['Eva'] 

(3) If no spaces in the key, we can use the simpler dot attribute approach. Find Sam's grades with grades.Sam as shown in 'Accessing a DataFrame's columns' subsection.

In [26]:
grades.index = ['Test1', 'Test2', 'Test3']

In [27]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [28]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [29]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

## 2. Accessing Rows (loc, iloc):
(1) Like spreadsheets, we can access specific rows or columns.
(2) We use loc['ColA'] and iloc[i]  to access rows by name and index, respectively.
(3) Execute the examples using loc['Test1'] to get scores for the first exam, or iLoc[0] to get scores for the first exam and iLoc[1] to get scores for the second exam. Which do you prefer? 
(4) We can also get slices of rows, e.g., from ['Test1':'Test3'], inclusive, or, using index values, from [0:2], inclusive.

In [30]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [31]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [32]:
grades.loc['Test2']

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

I prefer the use of grades.loc as it allows me to name the row, making identification of data type easier to work with.

### Slices and Boolean Indexing
Using indexing and Booleans allow for filtering information in various forms. Each of these options allow for us to better understand the data and present it effectivly. Booleans allow for us to create targeted ranges, where as indexing allows us to access specific portions of tables and data.

In [33]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [34]:
grades.loc['Test1':'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [35]:
grades.iloc[[0, 2], 0:3]

       Wally  Eva  Sam
Test1     87  100   94
Test3     70   90   90

Boolean Indexing allows for selection capabilities

In [36]:
grades[(grades >= 80) & (grades < 90)]

       Wally   Eva  Sam  Katie   Bob
Test1   87.0   NaN  NaN    NaN  83.0
Test2    NaN  87.0  NaN   81.0   NaN
Test3    NaN   NaN  NaN   82.0  85.0

## 3. Accessing Subsets (at, iat)
(1) We can use similar notation to get a single cell in the DataFrame (much like getting a single cell in a spreadsheet). 
(2) Use grades.at['Test2', 'Eva'} to find her score on the second exam using labels.
(3) Use grades.iat[2,0] to get the score on the third exam for the first student (Wally), using indices.

In [37]:
grades.at ['Test2', 'Eva']

87

To get Wally's Test Graded for test 3:

In [38]:
grades.iat [2, 0]

70

## 4. Describe by Column
(1) Use grades.describe() to get descriptive statistics for our gradebook columns.
(2) See why learning Python and DataFrames can be so powerful?  
(3) Try to set the precision using the pd.set_option('precision',2) provided.
(4) Does it work? Libraries are evolving. If you get an error, copy the error text and do a web search.
(5) Can you find something about a newer option using "display.precision"?
(6) If so, try pd.set_option("display.precision",2).
(7) Being able to debug evolving features on your own is important for success.


### Failed set_option:
I left the failed set_option as a way to outline how changes in python accument change and that it isn't uncommon for us to look for derivatives or similar calls.

In [39]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [40]:
pd.set_option('percision', 2)

OptionError: "No such keys(s): 'percision'"

According to https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html, "display.precision sets the output display precision in terms of decimal places". Essentially the idea is to display the number in its decimal form. 

Being able to debug code and even work with newer formats allows for access to a host of new libaries and comands.

In [41]:
pd.set_option("display.precision", 2)

In [42]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

#### Finding the mean:

In [43]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

## 5. Transpose (rows <--> columns)
(1) Get the average for each column by calling grades.mean()
(2) Transpose the DataFrame using the T attribute.
(3) Get the mean by the new columns with .T.describe()

In [44]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

### Transposed Data Frame

In [45]:
grades.T

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

### Describing the Transposed Frame

In [46]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00   5.00   5.00
mean    92.80  81.20  83.40
std      7.66  11.54   8.23
min     83.00  65.00  70.00
25%     87.00  77.00  82.00
50%     94.00  81.00  85.00
75%    100.00  87.00  90.00
max    100.00  96.00  90.00

### Finding the mean of the Transposed Frame

In [47]:
grades.T.mean()

Test1    92.8
Test2    81.2
Test3    83.4
dtype: float64

## 6. Sort:
(1) Sort the gradebook rows in reverse order so the most recent exam row appears at the top with grades.sort_index(ascending=False)
(2) Sort the gradebook columns so the names appear in order using grades.sort_index(axis=1).
(3) We can sort our data pretty much however we like.

In [48]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [49]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

We can even sort grads based on the test by combining loc with .sort_values. That way it is possible to examine all of the grades in a chosen order which makes sorting the data easier.

In [50]:
grades.loc['Test2'].sort_values(ascending=False)

Wally    96
Eva      87
Katie    81
Sam      77
Bob      65
Name: Test2, dtype: int64

Using sort_values and sort_index returns a copy of the original DataFrame, this requires a lot of memory when applied to big data. It is possible to sort the data in place, rather than copying it. 

This is possible by using inplace=True to either sort commands.

## Self Check:
Given the following dictionary;
temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82], 'Thu': [75, 97], 'Fri': [62, 79]}

a) Convert the dictionary into the DataFrame named temperatures using Low and High as the indicies, then display the DataFrame
b) Use the column names to select only data the columns for part of the week.
c) Set the floating point precision to 2 and cacluate the average temps for each day.
d) calculate the average low and high temperatures.

In [51]:
temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82], 'Thu': [75, 97], 'Fri': [62, 79]}

In [52]:
temperatures = pd.DataFrame(temps, index=['Cool', 'Hot'])

In [53]:
temperatures

      Mon  Tue  Wed  Thu  Fri
Cool   68   71   66   75   62
Hot    89   93   82   97   79

### Temperatures from Tuesday to Friday

In [54]:
temperatures.loc[:, 'Tue':'Fri']

      Tue  Wed  Thu  Fri
Cool   71   66   75   62
Hot    93   82   97   79

### Mean of Temperatures

In [55]:
pd.set_option("display.precision", 2)

In [56]:
temperatures.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fri    70.5
dtype: float64